app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'PG-13') ORDER BY release_date ASC
SELECT "movies".* FROM "movies" ORDER BY release_date ASC
---
  def index
    redirect = false
    @all_ratings = Movie.all_ratings

    ratings = params[:ratings] || session[:ratings]
    if params[:ratings]
	session[:ratings] = params[:ratings]
    elsif session[:ratings]
	redirect = true
	params[:ratings] = session[:ratings]
	session.delete(:ratings)
    end

    order_by = params[:order_by] || session[:order_by]
    if params[:order_by]
	session[:order_by] = params[:order_by]
    elsif session[:order_by]
	redirect = true
	session.delete(:order_by)
	params[:order_by] = session[:order_by]
    end

    if redirect
	flash.keep
	redirect_to movies_path(:order_by=> order_by, :ratings=> ratings)
	return
    end

debugger
    if !order_by.nil? and !session[:ratings].nil?
	@movies = Movie.find(:all, :order => "#{order_by} ASC", :conditions => {:rating => session[:ratings].keys})
    elsif !order_by.nil? and session[:ratings].nil?
	@movies = Movie.order("#{order_by} ASC")